Repository: h53d/babylonjs-doc-cn
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: ## A Visit to The Playground ## We have worked hard and learned much, so we deserve some playground time, at the Babylon.js Playground web site.&nbsp; Here is a scene that I once created and then saved... at the playground:
zh_cn: ## 访问 娱乐展示厅 ## 我们做得很努力且学到不少东西了, 所以我们可以获得一些时间在 Babylon.js 娱乐展示厅游乐一下了.&nbsp; 此处是创建保存一次性场景的练习场:

source: ## Animation Blending
zh_cn: ## 动画渲染

source: ## Attach events to animations
zh_cn: ## 给动画添加事件

source: ## Babylon.js Objects, Properties, Methods, and Values ##
zh_cn: ## Babylon.js 对象, 属性, 方法, 和值 ##

source: ## Babylon.js WebGL Game Creation System!##
zh_cn: ## Babylon.js 页面图像库 游戏创建系统!##

source: ## BabylonJS Playground ##
zh_cn: ## BabylonJS 娱乐展示厅 ##

source: ## Basic animation
zh_cn: ## 简单动画

source: ## Complex animation
zh_cn: ## 复杂动画

source: ## Controlling animations
zh_cn: ## 控制动画

source: ## Diving into createScene() ## &nbsp; I would like you to visit the Babylon.js Playground once again (open in a new window or new tab, if possible), but this time we will visit its base URL at:
zh_cn: ## 深入 createScene() ## &nbsp; 我希望你在此访问下 Babylon.js 娱乐展示厅 (如果可能的话,用新的窗口或标签打开), 只是这次我们访问的是它的基础网址:

source: ## Easing functions
zh_cn: ## 简化函数

source: ## Helper function
zh_cn: ## 帮助函数

source: ## Hey, you made it!
zh_cn: ## 嘿, 你做到了!

source: ## More About The Playground ## Once again let's visit the saved playground scene that I sent you to, above.
zh_cn: ## 关于娱乐展示厅更多 ## 让我们再次访问上面发给你的保存的娱乐展示场景网站.

source: ## My New Friends - .position, .rotation, and .scaling&nbsp; ##
zh_cn: ## 新的帮手 - 位置属性(.position), 旋转属性(.rotation), 和缩放属性(.scaling)&nbsp; ##

source: ## Quick Downloading 'The Big 4' Externals ##
zh_cn: ## 快速下载'四大'外部资源 ##

source: ## Scene File Layout ##
zh_cn: ## 场景文件格式 ##

source: ## The Browser ## Simply put, you will need to use a browser that supports WebGL and has Javascript activated.&nbsp; Internet Explorer 11+, Firefox 4+, Google Chrome 9+, Opera 12+, etc.&nbsp; WebGL is also supported by many browsers for mobile devices.&nbsp; I will let you investigate the details of mobile WebGL, but know that Babylon.js has many features designed with mobile WebGL in mind.&nbsp; Additionally, Babylon.js has complete support for full-immersion stereoscopic viewing and virtual reality head gear!
zh_cn: ## 浏览器 ## 简而言之,你需要一个支持WebGL并且激活了javascript的浏览器.&nbsp; IE11+, Firefox 4+, Google Chrome 9+, Opera 12+, 等都可以.&nbsp; WebGL 也被许多移动设备等浏览器支持.&nbsp; 请你自己调查移动设备的WEBGL详细情况, 但是你需要知晓的是 Babylon.js 有许多特性在设计时考虑了移动设备WebGL的.&nbsp; 此外, Babylon.js 已经全面支持沉浸式立体视野和虚拟现实头盔!

source: ## Useful Links ## | Clickable Link&nbsp; | What you will find | | ------------- | ------------- | | [**BabylonJS Main Website**](http://www.babylonjs.com/) |&nbsp; Many great demos and useful links near the bottom | | [**BabylonJS Forum**](http://www.html5gamedevs.com/forum/16-babylonjs) | Ask questions, help others, meet great friends | | [**BabylonJS GitHub Site**](http://www.babylonjs.com) |&nbsp; Downloads, tutorials, and many links (scroll down when there) | | [**BabylonJS API Documentation**](http://doc.babylonjs.com) | A complete API map of all Babylon.js classes | | [**BabylonJS Playground**](http://babylonjs-playground.azurewebsites.net) |&nbsp; On-line white-boarding and basic scene testing site | | [**BabylonJS Sandbox**](http://www.babylonjs.com/sandbox) | On-line site for testing .babylon files exported from modelers |
zh_cn: ## 有用链接 ## | 可点击链接&nbsp; | 可找到内容 | | ------------- | ------------- | | [**BabylonJS 主站**](http://www.babylonjs.com/) |&nbsp; 许多很棒的演示而且底部有有用的链接 | | [**BabylonJS 论坛**](http://www.html5gamedevs.com/forum/16-babylonjs) | 询问,助人,预见小伙伴 | | [**BabylonJS GitHub 站点**](http://www.babylonjs.com) |&nbsp; 下载, 教程, 和许多链接 (在那个页面的底部) | | [**BabylonJS API 文档**](http://doc.babylonjs.com) | 所有Babylon.js类的完整 API 图册 | | [**BabylonJS 娱乐展示**](http://babylonjs-playground.azurewebsites.net) |&nbsp; 在线的,白板式 基础场景测试站点 | | [**BabylonJS 沙箱**](http://www.babylonjs.com/sandbox) | 在线测试从建模工具导出的 .babylon 文件.

source: ## Vector3 and Color3 Values ##
zh_cn: ## Vector3 和 Color3 值 ##

source: ### The CSS Styles - Blue Section ### &nbsp;Notice the blue section of the big picture.&nbsp; That is the CSS (Cascading Style Sheets) styles used to present the scene's web page,&nbsp; and adjust its WebGL canvas to be centered and filled-out nicely in your browser.
zh_cn: ### CSS 样式 - 蓝色部分 ### &nbsp;注意大图片中的蓝色部分.&nbsp; 那是用来呈现场景页面的 CSS (布局样式表) 样式,&nbsp; 它会调整 WebGL 画布居中且填满你的整个浏览器.

source: ### The External Includes - Red Section ###
zh_cn: ### 外部包含 - 红色部分 ###

source: ### The Internal Include - Green Section ###
zh_cn: ### 内部包含 - 绿色部分 ###

source: ### The createScene() Function - Purple Section ### The purple section of the big picture... is the createScene() 'function'... a Javascript 'function'.&nbsp; It is the most important section of a 'single HTML file' Babylon.js scene.&nbsp; You are not required to use a createScene() function in your Javascript code, but please do... in these early days of your webGL learning.&nbsp; I have some magic to show you... which is available if you keep most of your scene code... inside a function called createScene().&nbsp; (Like the one shown in the big picture.)
zh_cn: ### createScene() 函数 - 紫色部分 ### 大图片里的紫色部分...是createScene() '函数'... 一个Javascript '函数'.&nbsp; 它是'单HTML文件'场景里的最重要部分的.&nbsp; 在你的Javascript代码里你不必使用createScene()函数, 但是在学习WebGL的早期日子里,请这样做吧.&nbsp; 我有些魔法展示给你看... 如果你把大部分的场景代码放到一个叫做createScene()的函数里.&nbsp; (就像大图片里展示的那样.)

source: ### Vector3 Values ### Vector3 values take the form of... ``` javascript BABYLON.Vector3(xValue, yValue, zValue) ``` They are often used to set/store...
zh_cn: ### Vector3 值 ### Vector3 值的形式是... ``` javascript BABYLON.Vector3(xValue, yValue, zValue) ``` 它们长被用来设置/存储...

source: &nbsp; ### Color3 Values ### Color3 values look very much like Vector3 values.&nbsp; Here is an example: ``` javascript BABYLON.Color3(rValue, gValue, bValue) ``` The rValue is for red, the gValue is for green, and the bValue is for blue.&nbsp; I bet you have already figured out that Color3 values are used for setting colors.&nbsp; The rValue, gValue, and bValue, all contain float numbers in the range of 0 to 1.&nbsp; Let's look at a few examples: ``` javascript BABYLON.Color3(1, 0, 0) - red BABYLON.Color3(0, 1, 1) - cyan BABYLON.Color3(0, 1, 0) - green BABYLON.Color3(1, 0, 1) - violet BABYLON.Color3(1, 1, 0) - yellow BABYLON.Color3(0, 0, 0) - black BABYLON.Color3(1, 1, 1) - white BABYLON.Color3(0.5, 0.5, 0.5) - medium gray BABYLON.Color3(0.2, 0, 0.2) - dark purple ``` &nbsp; Not so difficult.&nbsp; Let's say that you wanted to put a color on a box that you have already created.&nbsp; The first thing you do is create a Javascript object called a StandardMaterial.&nbsp; Then you would apply (set) that StandardMaterial as the box's .material property.&nbsp; This is covered by our Materials tutorial, but let's look at how that is done, here.
zh_cn: &nbsp; ### Color3值 ### Color3值非常像Vector3值.&nbsp;这儿是个例子: ``` javascript BABYLON.Color3(rValue, gValue, bValue) ``` 该rValue是用来表示红色, 该gValue用来表示绿色, 同时该bValue是用来表示蓝色.&nbsp; 我猜你已经知道Color3是用在颜色上的.&nbsp; 这些rValue, gValue, 和 bValue, 都是在0和1间的浮点值.&nbsp; 让我们看些例子: ``` javascript BABYLON.Color3(1, 0, 0) - 红 BABYLON.Color3(0, 1, 1) - 青 BABYLON.Color3(0, 1, 0) - 绿 BABYLON.Color3(1, 0, 1) - 紫 BABYLON.Color3(1, 1, 0) - 黄 BABYLON.Color3(0, 0, 0) - 黑 BABYLON.Color3(1, 1, 1) - 白 BABYLON.Color3(0.5, 0.5, 0.5) - 中灰 BABYLON.Color3(0.2, 0, 0.2) - 暗紫 ``` &nbsp; 没看起来这么难.&nbsp; 让我们假设你要把一个颜色用到你之前已经创建的一个盒子上.&nbsp; 你要做的第一件事情是创建一个叫做标准材质的Javascript对象.&nbsp; 然后将该标准材质应用(设置)到盒子的材质(.material)属性上.&nbsp; 这将在材质教程里讲, 但现在我们看这是如何做到的.

source: 'Includes' is not necessarily the best term to describe the red section of the big picture, but I will be using that term often in this tutorial.&nbsp; Three external Javascript files are being included into this scene.
zh_cn: '包含' 不一定是对 图中红色部分的最好的描述方式, 但是在这个教程中我会常常使用这中方式.&nbsp; 三个外部的Javascript文件被包含到这个场景里.

source: * Use previous values and increment it: ```BABYLON.Animation.ANIMATIONLOOPMODE_RELATIVE``` * Restart from initial value: ```BABYLON.Animation.ANIMATIONLOOPMODE_CYCLE``` * Keep their final value: ```BABYLON.Animation.ANIMATIONLOOPMODE_CONSTANT```
zh_cn: * 使用之前的值然后递增： ```BABYLON.Animation.ANIMATIONLOOPMODE_RELATIVE``` * 从初始值重启 ```BABYLON.Animation.ANIMATIONLOOPMODE_CYCLE``` * 保持最后的值: ```BABYLON.Animation.ANIMATIONLOOPMODE_CONSTANT```

source: **Javascript Objects**
zh_cn: **Javascript 语言里的对象**

source: **Methods**
zh_cn: **方法**

source: **Next step**
zh_cn: **下一步**

source: **Objects**
zh_cn: **对象**

source: **POSITION** - Also called translation, every mesh is POSITIONED in a scene using X, Y, and Z settings.&nbsp; You can think of the .position property... as the mesh's LOCATION.&nbsp; The link below... is a saved playground scene that illustrates using a mesh's .position property.&nbsp; Try to open it in a new window or new tab, so you can jump back and forth between this tutorial... and the playground scene:
zh_cn: **位置** - 也被叫作平移, 每个网格对象都通过设定其X, Y, 和Z来被定位到场景里.&nbsp; 你可以把位置属性(.position)认为称网格对象的定位.&nbsp; 下面的链接... 是一个保存的娱乐场景,它阐述了网格对象的位置属性的使用.&nbsp; 请试着在新窗口或标签页中打开, 那样你就可以前后跳转,以在本教程和娱乐展示场景间切换:

source: **Parameter 1** - Name of this animation, nothing more.
zh_cn: **参数1** - 动画的名称，仅此而已。

source: **Parameter 2** - The property concerned.
zh_cn: **参数 2** - 关心的属性。

source: **Parameter 3** - Frames per second requested: highest FPS possible in this animation.
zh_cn: **参数 3** - 请求的每秒帧数：这个动画里最大 的FPS。

source: **Parameter 4** - Type of change.
zh_cn: **参数 4** - 修改的类型。

source: **Parameter 5** - Finally, you have to decide and enter the type of behavior this animation will take at its upper limit (e.g. will it continue on, will it begin again, will it stop at the last key value, etc.):
zh_cn: **参数 5** - 最后, 你需要决定并输入这个动画的行为类型，这些会决定动画的受限(比如:当到最后一帧时是否继续，是否重新开始，或者停止)：

source: **Parameters for scene.beginAnimation:**
zh_cn: **提供给scene.beginAnimation的参数：**

source: **Properties**
zh_cn: **属性**

source: **ROTATION** - Every mesh is ROTATED in a scene... by setting the amount of spin around the shape's X, Y, and Z axes.&nbsp; Picture a box with a rod stuck through every side and coming out the opposite side.&nbsp; There are 6 sides to a box, so there would be 3 rods, an X rod, a Y rod, and a Z rod.&nbsp; Rotation is the amount (and direction) of spin...
zh_cn: **旋转** - 场景里的每个网格的旋转... 都是通过设置造型的X, Y, 和 Z 轴的自旋量来实现的.&nbsp; 想象一个画面:一个盒子,每个面都有个棒从这个面的边穿进去另一边穿出来.&nbsp; 一个盒子有6个面, 所以需要3个棒, 一个为X轴, 一个为Y轴, 同时一个为Z轴.&nbsp; 旋转是自旋量(包括方向)的累积...

source: **SCALING** - Scaling... is stretching or shrinking... along any of the 3 scene axes.&nbsp; Let's jump right into a saved playground scene that demonstrates scaling:
zh_cn: **缩放** - 缩放... 是指拉伸或缩小... 沿着场景轴的三个方向中的任意方向.&nbsp; 我们直接跳转到娱乐展示厅中演示缩放的场景:

source: **Values**
zh_cn: **值**

source: - The animation is starting right after the method call.
zh_cn: - 这些动画在该函数调用后立即播放.

source: - ```BABYLON.EasingFunction.EASINGMODE_EASEINOUT``` : Interpolation uses EaseIn for the first half of the animation and EaseOut for the second half.
zh_cn: - ```BABYLON.EasingFunction.EASINGMODE_EASEINOUT``` : 头半部份用EASEIN的方式,后半部份用EASEOUT的方式来控制插入.

source: - ```BABYLON.EasingFunction.EASINGMODE_EASEOUT``` : Interpolation follows 100% interpolation minus the output of the formula associated with the easing function.
zh_cn: - ```BABYLON.EasingFunction.EASINGMODE_EASEOUT``` : 按照内插法 减去 简化函数的公式输出 来控制插入 .

source: - the value of a .position property on mesh, light, or camera objects - the value of a .rotation property on a mesh object - the value of a .scaling property on a mesh object - the value of a .direction property on a light object
zh_cn: - 网格,灯光活着相机对象的位置(.position)属性的值 - 网格对象的旋转(.rotation)属性的值 - 网格对象的缩放(.scaling)属性的值 - 灯光对象的方向(.direction)属性的值

source: --- ID_PAGE: 22621 PG_TITLE: A Babylon.js Primer --- Welcome to the...
zh_cn: --- ID_PAGE: 22621 PG_TITLE: A Babylon.js 初级教程 --- 欢迎到此...

source: --- ID_PAGE: 22631 PG_TITLE: The Playground Tutorial --- Introducing...
zh_cn: --- ID_PAGE: 22631 PG_TITLE: 娱乐场教程 --- Introducing...

source: // Adding animation to my torus animations collection torus.animations.push(animationTorus);
zh_cn: // 将动画添加到我的 椭圆环体动画集中 torus.animations.push(animationTorus);

source: // Adding the easing function to the animation animationTorus.setEasingFunction(easingFunction);
zh_cn: // 将简化函数添加到动画中 animationTorus.setEasingFunction(easingFunction);

source: // And here is how it is colored green... myLines.color = new BABYLON.Color3(0,1,0); ``` The creation of the lines object was a bit strange, but it sure was easy to make it green, using a Color3 value.&nbsp; You will learn more about the lines mesh....
zh_cn: // 然后是如何对它着色... myLines.color = new BABYLON.Color3(0,1,0); ``` 线对象的创建优点怪怪的, 但是使它为绿色确很简单, 使用一个Color3值.&nbsp; 关于线网格你将会学到更多....

source: // Animation keys var keysTorus = []; keysTorus.push({ frame: 0, value: torus.position }); keysTorus.push({ frame: 120, value: nextPos }); animationTorus.setKeys(keysTorus);
zh_cn: // 动画片段的键值 var keysTorus = []; keysTorus.push({ frame: 0, value: torus.position }); keysTorus.push({ frame: 120, value: nextPos }); animationTorus.setKeys(keysTorus);

source: // Creates a BABYLON.DirectionalLight type of object var light = new BABYLON.DirectionalLight("Dir0", new BABYLON.Vector3(0, -1, 0), scene);
zh_cn: // 创建一个 BABYLON.DirectionalLight 方向光对象类型 var light = new BABYLON.DirectionalLight("Dir0", new BABYLON.Vector3(0, -1, 0), scene);

source: // Creates a BABYLON.FreeCamera type of object var camera = new BABYLON.FreeCamera("freecam", new BABYLON.Vector3(0, 0, 5), scene);
zh_cn: // 创建一个 BABYLON.FreeCamera 自由相机对象类型 var camera = new BABYLON.FreeCamera("freecam", new BABYLON.Vector3(0, 0, 5), scene);

source: // Creates a BABYLON.Mesh type of object var mybox = BABYLON.Mesh.CreateBox("box", 6.0, scene); ``` You get the idea.&nbsp; Javascript objects, are used often in Babylon.js scenes.&nbsp; Sometimes you will create them, and other times you will get a 'reference' or 'handle' to an object that was created earlier.&nbsp; Getting a reference/handle to a Javascript object, essentially means opening a communication line to an already-built object.
zh_cn: // 创建一个 BABYLON.Mesh 网格对象类型 var mybox = BABYLON.Mesh.CreateBox("box", 6.0, scene); ``` 你该清楚了.&nbsp; Javascript 对象, 常常用在 Babylon.js 场景里.&nbsp; 又是你创建它们, 另外一些时候你获得一个早些时候创建的对象的'引用' 或 '句柄' .&nbsp; 持有一个Javascript对象的引用或句柄, 实质上意味着和已有的对象建立了通信线.

source: // Creates a BABYLON.Scene type of object.
zh_cn: // 创建一个 BABYLON.Scene 场景对象类型.

source: // Creating an easing function var easingFunction = new BABYLON.CircleEase();
zh_cn: // 创建一个简化函数 var easingFunction = new BABYLON.CircleEase();

source: // For each easing function, you can choose beetween EASEIN (default), EASEOUT, EASEINOUT easingFunction.setEasingMode(BABYLON.EasingFunction.EASINGMODE_EASEINOUT);
zh_cn: // 对于每个简化函数, 你可以从 EASEIN (default), EASEOUT, EASEINOUT 中选择一个模式 easingFunction.setEasingMode(BABYLON.EasingFunction.EASINGMODE_EASEINOUT);

source: // Gradient is the percent of value change
zh_cn: // Gradient 是改变值的百分比

source: // Here is the core method you should change to make your own Easing Function
zh_cn: // 这是你创建自己的简化函数时应该修改的核心方法.

source: // the torus destination position var nextPos = torus.position.add(new BABYLON.Vector3(-80, 0, 0));
zh_cn: // 椭圆环体的目标位置 var nextPos = torus.position.add(new BABYLON.Vector3(-80, 0, 0));

source: //At the animation key 0, the value of scaling is "1"
zh_cn: //在动画0键，放大倍数是 1。

source: //At the animation key 100, the value of scaling is "1"
zh_cn: //在动画的第100键，放大倍数是1。

source: //At the animation key 20, the value of scaling is "0.2"
zh_cn: //在动画的第20键，放大倍数是0.2。

source: //Create a box
zh_cn: //创建盒子

source: //Finally, launch animations on torus, from key 0 to key 120 with loop activated scene.beginAnimation(torus, 0, 120, true); ```
zh_cn: //最后, 以不断重复从0到120键值的方式加载动画 scene.beginAnimation(torus, 0, 120, true); ```

source: //Here... your basic scene as before: [scene, light, camera]
zh_cn: //这儿... 作为开头的基础场景元素[scene,light,camera]

source: //Your code here }); ```
zh_cn: //你的代码放在这里 }); ```

source: A Camera.**&nbsp; The three most commonly used TYPES of cameras... are ArcRotateCamera, FreeCamera, and TouchCamera.&nbsp; There are many types of camera available in Babylon.js, but these three are the most common.&nbsp; ANY number of cameras can be coded into a scene, but only one of those cameras... is the 'active camera'.&nbsp; We have a tutorial in our Playpen Series... dedicated to talking about cameras.
zh_cn: 相机.**&nbsp; 众多相机类型里3种常用的是, ArcRotateCamera(弧形旋转相机), FreeCamera(自由相机), 和 TouchCamera(触控相机).&nbsp; 在Babylon.js里有许多种可用的相机, 但是这3种是最常见的.&nbsp; 一个场景里可以编码任意多个相机, 但是只有其中一个能是'激活的相机'.&nbsp; 在操练系列教程里我们有一个例子, 专门谈论各种相机.

source: A Light.**&nbsp; &nbsp;There are 4 basic types of lights available in Babylon.js.&nbsp; They are PointLight, SpotLight, DirectionalLight, and HemisphericLight.&nbsp; ANY number of lights can be coded into a scene,&nbsp; but only the first 4 lights in the scene's lights list... will be used by the scene.
zh_cn: 光源.**&nbsp; &nbsp;在Babylon.js里有4种基础类型的光源.&nbsp; 它们是 PointLight(点光灯光源), SpotLight(聚光灯光源), DirectionalLight(平行光光源), 和 HemisphericLight(半球光源).&nbsp; 一个场景里编码任意数量的光源,&nbsp; 但是在场景光源列表里只有前4个光源被场景使用.

source: A Shape.**&nbsp; A shape is also called a **mesh**.&nbsp; Every scene needs something to be viewed, right?&nbsp; Cameras are invisible, and so are lights.&nbsp; Every scene needs a mesh, or many.&nbsp; There is no limit to the number of mesh in your scene.&nbsp; A mesh can be one of the many shapes that are built-in to Babylon.js, or it can be a shape that you plotted yourself using Babylon's VertexData system, or it can be a mesh that has been 'imported' into the scene... from a modeling package such as Blender or 3D Studio Max.
zh_cn: 有型物.**&nbsp; 有型物也叫做 **网格对象**.&nbsp; 每个场景里都需要可视物,对吧?&nbsp; 相机是不可见的, 光源也不可见.&nbsp; 每个场景都需要个有型物, 或者许多个.&nbsp; 没有限制在你的场景里可有的网格对象个数.&nbsp; 一个网格对象可以是Babylon.js的许多内置有型物之一, 或者是你自己通过Babylon.js的顶点数据系统绘制的有型物, 或者是从外部建模软件,例如 Blender 或 3D Studio Maxl里'导入'到场景里的一个网格对象.

source: AROUND each of these invisible rods.&nbsp;
zh_cn: 围绕每个这些无形的棒.&nbsp;

source: After that comes oimo.js - a different physics 'engine' that performs a similar function to cannon.js, but is generally faster although it lacks some of the more advanced features present in cannon.js.
zh_cn: 之后的是 oimo.js - 一个不同的物理 '引擎', 其表现的功能有点像 cannon.js, 但是它更快速高效, 尽管它缺少 cannon.js中出现的许多高级特性.

source: Again, take some time to watch the scene.&nbsp; And once more, the yellow text shows the one-line Vector3 way of setting a mesh's .scaling, or you can use one or more of the discrete ways of setting scaling... shown in the green text.
zh_cn: 再次的,请花些时间观察下该场景.&nbsp; 而且又一次的, 黄颜色的文本显示了通过一行代码里用Vector3量设置网格的缩放(.scaling)属性的方式, 或者你也可以使用一种或多种方式零散设置缩放... 绿色文本显示了那些方法.

source: All those easing functions are implemented in BABYLON allowing you to apply custom mathematical formulas to your animations.
zh_cn: 所有这些BABYLON实现的简化函数,都允许使用自定义的数学公式应用在动画上.

source: Although this playground is blending the same animation into itself, more often, a different animation will be blended-into the original, such as when a walking character changes to running.
zh_cn: 尽管这个娱乐展示的是 渲染自身重复的动画, 但更常见的情况是, 渲染不同的动画 - 进入不同的状态,比如当一个走动中的角色切换到跑动.

source: Although we have another tutorial that covers basic scenes, I would like you to now EXAMINE a basic Babylon.js scene file.&nbsp; So here we go:
zh_cn: 尽管我们有另一个教程盖含基础场景, 我仍然希望你现在检查下一个基本的 Babylon.js 场景文件的内容.&nbsp; 所以我们现在就开始:

source: An Animation is defined by various properties and a collection of keys.
zh_cn: 一个动画是由许多属性和一系列的键值定义的。

source: An event is a function that will be called at a given frame.
zh_cn: 一个事件 是在某指定帧会被调用的函数.

source: And that's it!
zh_cn: 就这些!

source: And you are done!
zh_cn: 你做到了!

source: Animations --- # Animation Your scene is beginning to look great, but it is very static.
zh_cn: 动画 --- # 动画 你的场景开始看起来很棒了，但它仍然是呆板且静态。

source: Another use for a Vector3 value... is setting the .direction for certain types of lights:
zh_cn: 那外种使用 Vector3 值是用来设置灯光的方向:

source: Another use of the Color3 value is to set the .diffuse property of lights.&nbsp; Take careful note that the name of this property is .diffuse, and not .diffuseColor.&nbsp; Lights use a property named .diffuse to set their primary color.&nbsp; Let's take a look at how to set the primary color of a light that you have already created:
zh_cn: 另一个Color3值的用途是设置光的散射(.diffuse)属性.&nbsp; 注意该属性的名字是.diffuse, 而不是.diffuseColor.&nbsp; 光源使用一个名为.diffuse的属性设置其主色.&nbsp; 让们看看如何给那个你创建的光源设置主色:

source: As of Babylon.js 2.3+, you can start an animation with *enableBlending* = true.
zh_cn: 作为2.3+版本的 Babylon.js, 你能通过设置 *enableBlending* 为 true来启动一个动画.

source: As you toured the Babylon.js Playground demo scenes, you surely saw some .position, .rotation, and maybe some .scaling properties being 'set' with values.&nbsp; Let's take a look at each one:
zh_cn: 如果你浏览了Babylon.js娱乐展示厅的演示场景, 你必定看到了一些位置属性(.position), 旋转属性(.rotation), 可能还有些缩放属性(.scaling)设置了值.&nbsp; 让我们一个个的看看:

source: Below that, in green text, you will see 3 more lines of Babylon.js code.&nbsp; You see, you are NOT required to use a Vector3 to set a .position on a mesh.&nbsp; You can use the '**discrete**' way, instead.&nbsp; Loosely defined, 'discrete' means... piece by piece... one step at a time.&nbsp; If you would like to set a mesh's .position values axis by axis, feel free to use the handy green 'discrete' ways of doing it.
zh_cn: 在那下面, 在绿色文本里, 你将看到另3行Babylon.js代码.&nbsp; 你该清楚了, 你不需被迫使用Vector3值来设置网格的位置属性(.position).&nbsp; 相反,你可以用'**零散(discrete)**'的方式.&nbsp; 没有严格的定义, '林散' 意味着... 一块一块的... 一次一小步.&nbsp; 如果你想一个轴一个轴的设置网格的位置属性, 可以自便的按照那个些绿色'零散'的方式去做.

source: By default these functions are the following:
zh_cn: 默认情况下,这个函数如下:

source: Click on it, please.&nbsp; Notice that there is a wide variety of pre-installed scenes (createScene functions).&nbsp; Feel free to select any of them.&nbsp; Tour them, drag your pointer around on them, and even change the code in the editor and hit **RUN** again.&nbsp; You cannot damage the pre-installed scenes, even if you hit **SAVE**.&nbsp; You are safe in a playground of Babylon.js scenes, and you can see MANY createScene functions in action.&nbsp; You can play with their settings and hit Run again - fun.&nbsp; And again, you can use the **Get .zip** button on any of these playground demos, and take copies of them for your home collection.&nbsp; Handy, yes?
zh_cn: 请点击它.&nbsp; 注意那有许多不同当预装场景 (创建场景的功能).&nbsp; 可以在它们中自便的选择.&nbsp; 浏览一下, 在之中拖动鼠标, 甚或在编辑区域修改下代码然后点击 **运行** .&nbsp; 你不可能毁坏预装的场景, 甚至你点击了 **保存**也不会.&nbsp; 你在 Babylon.js 的娱乐展示厅的场景里很安全, 而且你可以看到许多的创建场景的函数.&nbsp; 你可以使用它们的设定玩一下, 再次点击 运行.&nbsp; 再次的, 你可以使用娱乐演示图任何一个演示上方的 *获取 .zip压缩包**, 从而实现你的收集梦想.&nbsp; 方便, 是吧?

source: Don't forget to [visit our API documentation](http://doc.babylonjs.com/classes/) in order to learn more about the [**Babylon.js Animation**](http://doc.babylonjs.com/classes/Animation) and [**Babylon.js Animatable**](http://doc.babylonjs.com/classes/Animatable) classes.
zh_cn: 不要忘记 [访问我们的API文档](http://doc.babylonjs.com/classes/) 以学习更多关于 [**Babylon.js 动画**](http://doc.babylonjs.com/classes/Animation) 和 [**Babylon.js 支持动画的**](http://doc.babylonjs.com/classes/Animatable) 类.

source: Don't hesitate to combine many animations for one mesh object... by creating more Animations and pushing them into the mesh's _animation_ property.
zh_cn: 不要犹豫在一个网格对象上合并多个动画, 通过创建多个动画片段并把它们追加到 _animation_ 属性上.

source: Don’t hesitate to combine all those types of animations.
zh_cn: 不用犹豫, 可以混合使用所有这些动画类型.

source: Each Animation has a property called ```currentFrame``` that indicates the current animation key.
zh_cn: 每个动画片段都有一个属性: ```currentFrame``` , 其指明当前动画的键.
